run/Reorientation/constant/interfaceModels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      interfaceModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




surfaceTensionForceModel CSFAlpha; //CSFRDF

CSFAlphaCoeffs // CSFRDF
{
    sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0153;
}

// ************************************************************************* //
